{
  "3": "In 1970, a student in distress tried unsuccessfully to find help one night. Feeling hopeless and alone, he ended his life. A group of students and professors at the University decided to start a crisis center where anyone could call to talk about whatever was on their mind. It had to be free...it had to be confidential...it had to be compassionate. Thus, Agora was begun as one of the first crisis centers of its kind in the United States. \r\n\r\nSince then, nearly 5000 volunteers have served on our crisis line, and hundreds of thousands of callers have been helped. Who calls us? Teens call to talk about bullying, college students call to talk about school, parents call to talk about their children, elders call to talk about loneliness, and many others. \r\n\r\n## What We Do\r\n\r\nSometimes it's hard to talk about our problems with family and friends. As trained crisis hotline specialists, our volunteers are ready to provide compassionate, non-judgmental help for anyone in need of emotional support. Anyone is welcome to use our service, and you do not need to be \"in crisis\" to call or chat with us. \r\n\r\nAt Agora, we won't tell you how to solve your problem, but we'll help you figure out what options you might have. Agora provides many services including an all-issues crisis phone line, is part of the National Suicide Prevention Lifeline network, an on-line chat service, the only Substance Abuse hotline in New Mexico, have access to an extensive referral database, and offer a range of training and educational outreach options for the community.\r\n\r\nWe specialize in compassionate listening services for anyone who is experiencing a crisis in their life. When you call us you can expect to be greeted by a trained crisis specialist who will listen to anything you want to talk about in a safe and supportive manner.\r\n\r\n## Who Calls Us? \r\n\r\nParents, students, teens, seniors, bereaved , medical professionals, teachers, veterans, LGBTQAA, and you!\r\n\r\nReasons to call us:\r\n\r\n* You're just stressed\r\n\r\n* jobs loss\r\n\r\n* family issues\r\n\r\n* grief\r\n\r\n* work related stress\r\n\r\n* feeling under pressure\r\n\r\n* struggling with a medical diagnosis\r\n\r\n* you/someone you care about is struggling with addiction\r\n\r\n* death of a loved one\r\n\r\n* in need of a referral for service\r\n\r\n* you are having thoughts of suicide\r\n\r\nWhen you call our help-line, we won't ask your name - only your zip code and a few other anonymous questions which help us secure funding. Our service is confidential and offered free of charge. We have many callers who need help, so if you don't get through at first it is because our volunteers are already on calls. Please know that we want to talk with you, so call back or leave us a message so we can call you.",
  "4": "Saranam operates a 2-year housing, education, and community-building program for homeless families in Albuquerque, NM. Saranam offers a comprehensive range of long-term services to assist families in _transitioning beyond homelessness._\r\n\r\nWe work with homeless families, at least one adult and one child with a legal connection, who have a desire and motivation to change their lives to end their homelessness.\r\n\r\nThe program began under an endowment by Frances Thaxton Ash. The initial program developers chose the name __saranam__, which means __refuge__ in a Sanskrit dialect, from the song, Saranam, Saranam, Saranam.\r\n\r\n# Saranam is Unique\r\n\r\n__Saranam Values Housing,__ the foundation for a family's stability. Saranam provides transitional housing with each family having their own rent-free furnished apartment.\r\n\r\n__Saranam Values Education,__ a path toward increased earning potential. Saranam requires every adult to pursue educational development opportunities. The 2-year long program enables families to focus on acquiring education and skills needed to function without assistance.\r\n\r\n__Saranam Values Community,__ because a lack and loss of community support systems leads to homelessness. Thus, we provide intensive case management focused on individual needs and incorporate relationship-building into every aspect of our program. Saranam accepts families into the program in “classes” so they have an immediate peer group from which to begin building community and support networks.\r\n\r\n_Saranam is not a Group Home, drug/alcohol treatment facility, a domestic abuse shelter, a mental health treatment facility, nor do we provide any emergency services/shelter services._",
  "5": "Founded in 1996, Keshet is an Albuquerque-based nonprofit which exists to inspire and unite community by fostering unlimited possibilities through dance, mentorship and a creative space for the arts. Uniting the arts, the artist and the audience, Keshet invites you to engage, experience and be inspired through bold explorations of movement and celebrations of community.  \r\n\r\nLocated at Keshet Center for the Arts, all of Keshet’s programming is based on the core values of inclusion, authenticity, excellence, opportunity, fluidity and personal growth.\r\n\r\n## Global to Local; Local to Global \r\n\r\n__Keshet International Dance Residencies and Events__ Year round programming of performances, master classes, shindigs, gatherings, and makers space with international and national visiting contemporary dance artists at the Keshet Center for the Arts; bringing global to local.\r\n\r\n__Keshet New Dance Works – Creation and Touring__ (Keshet Dance Company) New works created for and with Keshet by local, national, and international choreographers; created locally, toured globally.\r\n\r\n## The Business of Art\r\n\r\n__Keshet Ideas and Innovation Community__ (KIIC, pronounced “kick”) A business incubator and resource programming for arts entrepreneurs; championing the value of the artist and the arts economy.\r\n\r\n__Makers Space and Residency Opportunities__ Multiple residency formats supporting performing artists at the Keshet Center for the Arts.\r\n\r\n## Social Justice through Dance\r\n\r\n__Movement + Mentorship = Metamorphosis__ (M3) Keshet’s M3 Program uses the vehicle of dance to engage, educate, and empower incarcerated and paroling youth and young adults.\r\n\r\n__New Mexico Arts & Justice Network__ (NMAJN) A statewide network launched by Keshet and community partners to support system-impacted youth within the full juvenile justice continuum via the arts. The Network focuses on direct services & professional development/peer learning, research & evaluation, and youth driven policy/advocacy initiatives, supporting local and national juvenile justice reform.\r\n\r\n__Movement for Mercy__ co-created performance installations with system-impacted youth; including residencies and partnerships throughout the U.S.\r\n\r\n## Community Dance Education & Performance\r\n\r\n__Community Dance Classes__ Everyone should dance! Keshet classes are available to all levels, ages, and abilities from beginner to professional; from age 2 to 102.  To insure these classes are truly available to all, Keshet offers an unlimited, non-competitive scholarship program for dancers under 18 years old, and a Work/Study trade program for dancers 18+.\r\n\r\n__Mixed Ability/Adaptive Dance__ Insuring that dance programming is available and accessible to all dancers, including dancers and choreographers with differing physical and/or developmental abilities.\r\n\r\n__Keshet Pre-Professional Education__ (KP3) Comprehensive programming for students to pursue focused training in dance technique, choreography, performance and/or technical theater; preparing them for a career and/or higher education in their fields of interest.\r\n\r\n__Community Engagement Programming__ Includes the Title I Homeless Project, DEA Dance Project, and many other community partnerships.\r\n\r\n__Community Performance Series__ Highlighting the talent of our local and regional community, Keshet’s Community Performances have included Nutcracker on the Rocks, Alice, Winter and Spring Dance Concerts, Choreographers’ Showcases, and more!\r\n\r\nKeshet Dance Company is a 501 c3 non-profit and have been in good standing since 1996. Our EIN number is 85-0436623.",
  "6": "At the Carrie Tingley Hospital Foundation, we strive to assist families with their medical and daily living needs and offer long-term assistance, education and programs through funding for research scholarships and quality of life programs such as a summer wheelchair sports camp and scholarships for therapeutic horseback riding and dance lessons.\r\n\r\nWe believe that children with special needs should have the same opportunities as children who are typically developing. Carrie Tingley Hospital Foundation is the easiest and most effective way to make a positive impact in the lives of children with special needs and their families.\r\n\r\n# MISSION\r\n_“To enhance the lives of Carrie Tingley Hospital patients and special needs children and their families throughout New Mexico.”_\r\n\r\nCarrie Tingley Hospital Foundation is a philanthropic organization providing individualized services that bridge the gap for families and children with special needs that enable them to reach their full potential by giving them the same opportunities as children who are typically developing.\r\n\r\nThe UNM Carrie Tingley Hospital is the state’s only pediatric rehabilitative hospital and today serves thousands of children each year with many types of illnesses and disabling conditions and remains faithful to its founders’ vision, to help children make full use of their talents and abilities.\r\n\r\nSince 1937, UNM Carrie Tingley Hospital has provided care to children with chronic physical impairments and developmental disabilities. It is widely known for orthopedic surgery, prosthetics and orthotics technology and fabrication, and rehabilitation services.\r\n\r\nToday, Carrie Tingley Hospital Foundation is poised to grow and to continue to respond to the critical needs of UNM Carrie Tingley Hospital, its patients and their families",
  "8": "NMHM confronts hate and intolerance by teaching tomorrow’s upstanders in an arts integrated, age appropriate program covering human rights and social justice and based on lessons learned from the Holocaust. The museum’s exhibits highlight acts of prejudice and genocide throughout history.\n\nFounded in 1998 and opened in 2001, the Holocaust & Intolerance Museum of New Mexico is dedicated to eliminating hate and intolerance through education. Our exhibits illustrate–through artifacts, memorabilia, pictures, documents, videos, and books–historical conflicts caused by local, national, and global prejudice, culminating in the most unspeakable of all horrors, the Holocaust.\n\nThe museum has long been involved in the community and has organized and sponsored a wide variety of events including lectures, panel discussions, film screenings, plays, visual art exhibits, and dance performances. In addition to the hundreds of students who visit the museum each year, it also receives substantial walk-ins from New Mexican, out-of-state, and international visitors. We rely on volunteers, and, as the museum is free to the public, operate on generous donations from supporters and visitors as well as grants from foundations and grant making agencies.\n\nWe are dedicated to providing knowledge on genocides and intolerance throughout history continuing to present day. Approximately 60 percent of the museum focuses on the Holocaust, covering the horrors perpetrated by the Nazis against both Jews and non-Jews. The remaining space is devoted to other genocides, human rights, and social justice issues. The facility includes a research library that is available for public use. The museum has recently embarked on a program to revise all of its exhibits to reflect current perspectives and best practices in museum exhibits and education.",
  "9": "ReadWest, Inc. is a non-profit literacy agency providing one-to-one tutoring by trained certified volunteers. ReadWest is an Accredited Affiliate of ProLiteracy. Sixteen standards of quality are continually achieved to maintain ProLiteracy accreditation. Since its inception, ReadWest has provided over 3,500 adults with literacy services and is expanding to meet the growing needs of our community. ReadWest has served Bernalillo and Sandoval Counties for 25 years!\r\n\r\n## Our Vision\r\n\r\nReadWest believes that the ability to read and write is essential to economic self-sufficiency and personal well-being. ReadWest exists to increase literacy skills for adults as the means of achieving basic survival skills, parenting skills, employability and job skills, citizenship, and further education.\r\n\r\n## Our Mission\r\n\r\nReadWest’s mission is to provide quality one-to-one tutoring to adults seeking to transform their lives through enhanced literacy skills.\r\n\r\n## Our Services\r\n\r\n\r\n\r\nReadWest strives to provide its students with basic literacy, English language skills and computer skills needed to improve their employability, parenting and life skills. We provide a safe environment and hope for each student entering our facility. A student’s success is our success! ReadWest offers free one-to-one tutoring sessions for adults in the following areas:\r\n\r\n__Basic Literacy__ Our volunteer tutors assist English speaking adult learners to raise their reading and writing levels in private, two hours sessions once a week. The weekly tutoring sessions are arranged according to the student’s work and personal schedule.\r\n\r\n__English as a Second Language__ Tutors provide literacy and language acquisition services to adults for whom English is not a native language. Weekly, two hour, one-to-one sessions help learners acquire beginning English vocabulary and conversation as well as basic reading and writing instruction.\r\n\r\n__Computer Literacy__ Tutors instruct their adult learner in basic computer use. In modules developed by ReadWest, students learn how to use the internet, set up an email account, send an email with attachments, apply for jobs and other introductory computer uses.",
  "10": "New Mexico has very few services for youth experiencing homelessness and no specialized beds or services for Domestic Minor Sex Trafficking (DMST) victims. Youth homelessness is a contributing factor of teens being recruited, forced or defrauded into sex trafficking, yet there are many difficult barriers for these kids to access much needed services. NMDC believes in identifying, strategizing and collaborating to fill in gaps in services. Our identified gaps for 2019 have to do with youth experiencing homelessness and building support for them.\r\n\r\n## How We Do It\r\n\r\nNMDC provides free compassionate services to the underserved and marginalized people of Albuquerque.\r\n\r\nThis population includes youth experiencing homelessness, survivors of sex trafficking, trafficked minor children and trafficked immigrants\r\n\r\n### Spoken For\r\n\r\nOur adult program for sex trafficking survivors, providing emergency shelter, a transitional living program, case management and tangible resources.\r\n\r\n### Casa Aliento\r\n\r\nOur adult program for sex trafficking survivors who speak Spanish. All the same services and resources as Spoken For, but all service provision is in Spanish. This program can also help trafficked immigrants with T-Visas and U-Visas.\r\n\r\n### The Harbour\r\n\r\nAlbuquerque's first homeless youth drop-in center with the goal of providing resources to exploitable homeless youth and preventing the predatory trafficking of these youth.",
  "15": "__The refuge, still in its initial phases of development, continues to work on restoring the land to its natural state of native habitat along the Rio Grande.__\r\n\r\nAlready home to hundreds of species of wildlife and migratory birds as well as a premier environmental education field trip destination, the Refuge will expand over the next years to include:\r\n\r\n* Visitor’s center with amenities for the public\r\n* Resources for educational and community programming\r\n* Expansive restoration projects to transform the land back into a native high desert, wetland, grassland, and Bosque forest habitat landscapes\r\n\r\n## Our Vision\r\n\r\nWe envision Valle de Oro National Wildlife Refuge as a dynamic urban wildlife refuge with deep connections to the community, innovative design and programming that increases a sense of environmental responsibility and stewardship.\r\n\r\n \r\nOur vision is that the Friends of Valle de Oro NWR of the future is a dynamic group - a force for positive change, with a diverse membership, a healthy, well-managed budget, with growing financial and resource capacity.\r\n\r\nThe Friends contribute to Valle de Oro being a vital, exciting place of learning with a wide variety of environmental education programs, community activities, and events drawing many diverse visitors. Trails and other Refuge features guide the steps of local adults and children who visit regularly, gaining a love for the outdoors, and an awakening sense of stewardship. Refuge amenities and activities support increasing development of a conservation ethic, and inspire engagement in related local, regional, and national issues. We see increasing numbers of visitors from outside of Bernalillo County and around the world who become aware of and are sympathetic to our broader mission.\r\n\r\n![plan](https://friendsofvalledeoro.org/wp-content/uploads/2018/06/Refuge-Site-Planning.jpg)\r\n\r\n_Valle de Oro NWR Habitat Restoration Plan_\r\n\r\n## Volunteer Opportunities\r\n\r\nThe Friends of Valle de Oro, as well as the U.S. Fish and Wildlife Service, is always looking for volunteers! Please see our [database](https://app.betterimpact.com/PublicOrganization/b3787aa8-e924-452b-a1a7-885de4260f7d/1) for our latest opportunities.",
  "24": "Established in 1996 and opened in 2000 on four acres in Albuquerque’s South Valley, Mandy’s Farm is a nonprofit organization committed to providing high-quality support options for adults with intellectual and developmental disabilities.\r\n\r\nMandy’s Farm was founded by Ruthie and David Robbins with the goal of creating a safe and caring environment where individuals with disabilities could grow and thrive. It is named for their daughter Amanda (“Mandy”) who has Autism. Mandy’s Farm is a testimony to the perseverance of the Robbins family and the generous support of caring individuals and donors.\r\n\r\nMandy’s Farm was granted a contract with the Developmental Disabilities Supports Division in 2008 through the Department of Health, initially providing supported living services. In 2013, this contract expanded to encompass community support through a day program, as well as employment services.\r\n\r\nMandy’s Farm launched the VAMOS program, an initiative to address the needs of individuals on the waiting list for adult services in New Mexico, in 2018. Shortly thereafter, in 2019, Mandy’s Farm began providing services through the New Mexico AgrAbility Project, a collaborative program designed to provide support to individuals with disabilities who are interested in farming as a means of employment, as well as active farmers who are encountering barriers to success within their farming operation due to a new or existing disability.\r\n\r\nMandy’s Farm has received accreditation across all of our services for two consecutive three-year periods from CARF International and was previously accredited through the Council on Quality and Leadership.\r\n\r\nMandy’s Farm now supports over 200 individuals and their families each month, providing a lifeline to some of the most vulnerable members of our community.",
  "198": "Fathers Building Futures is a social enterprise based in Albuquerque, NM, led by a team of formerly incarcerated parents who serve as mentors and supervisors to parents (mostly fathers) returning home from prison. Our clients receive soft skills, job and financial training, and parenting skills on their path to become responsible parents and stable members of the community.\r\n\r\nOur mission is to fill the post-release vocational and financial gap “to ensure parents and families experiencing barriers from incarceration receive the best opportunities for stability -- emotionally, socially, and financially.” FBF’s social enterprise provides job training for six months, through its light manufacturing woodshop that produces urns and caskets, kitchen items (cutting boards/lazy susans), and numerous special orders, such as restaurant tabletops or bookshelves. Once clients are skilled up, we use our community partners to place them in long-term employment with opportunities for advancement.\r\nFBF places an emphasis on financial education. Our financial literacy program includes training on budgeting, banking, savings, debt reduction, credit building, and identity theft. Those who complete this program have the potential of starting an Individual Development Account, which is a matched savings program to be used for purchasing a home, starting a business, or going back to school.\r\n\r\nOur clients all participate in an evidenced-based parenting class, delivered by a social worker on staff, which is designed specifically for fathers coming out of prison. This program is an experiential curriculum designed to improve communication, understanding, and prevent the mindset developed in prison from being brought home and further damaging fractured relationships. Parents learn to understand and regulate their emotions, facilitating strong and nurturing parenting.",
  "203": "## Mission Statement\r\n\r\nWe advocate for children who’ve been abused or neglected by empowering community volunteers to speak up for them in the foster care system. Ensuring that every child grows up in a safe, nurturing and permanent home. \r\n\r\n__We advocate for the best interest of abused and neglected children…__\r\n\r\nBecoming a CASA will give you the tools to speak up for a child who’s been abused or neglected.\r\n\r\nImagine the experience of children who are removed from their homes because the people responsible for protecting them have not. These children find themselves in a world filled with social workers, lawyers, judges and courtrooms where life-altering decisions are made on their behalf.\r\n\r\nA CASA is a court appointed, trained and committed adult who ensures that each child’s individual needs remain a priority in an over-burdened child welfare system. They get to know the child while also gathering information from the child’s family, teachers, doctors, caregivers and anyone else involved in the child’s life in order to make independent and informed recommendations to help the judge decide what’s best for the child.\r\n\r\nIf you are looking for a meaningful and enriching volunteer opportunity in Bernalillo County and want to do something about child abuse, becoming a CASA is right for you. There are over 900 children in our county that still need an advocate.",
  "207": "__Our Mission__\r\n\r\nThe mission of Crossroads for Women is to provide comprehensive, integrated services to empower women emerging from incarceration to achieve safe, healthy, and fulfilling lives in the community, for themselves and \r\ntheir children.\r\n\r\n__Who We Are__\r\n\r\nCrossroads for Women is an Albuquerque-based nonprofit organization that provides housing and therapeutic services to empower New Mexico women emerging from incarceration.\r\n\r\n__Our History__\r\n\r\nFounded in 1997, Crossroads for Women has served New Mexico women and their children for over 20 years.\r\n \r\n__A Message from Our Founder__\r\n\r\nI was working on a class action case against the jail, trying to improve conditions for the inmates, particularly those with mental illness. Lawsuits have great power to effect change, but they have limitations too.\r\n\r\nWe were, in fact, making great changes in mental health services, but one couldn’t help but notice that the same people would show up in jail over and over. This seemed to be particularly true of women, some of whom had over a hundred bookings frequently for minor offenses such as littering and public nuisance. We were improving conditions for them in the jail, but they were being turned out to the streets with no chance of making a new life-no shelter, no job, no mental health care, no support.\r\n\r\nIt was obvious why they ended up back in jail and we couldn’t do anything about that through litigation. The courts, the jail, the DA, probation and parole were all willing to refer them to community services but the services didn’t exist. [CONTINUE READING](https://crossroadsabq.org/a-message-from-our-founder/)",
  "211": "Horizons Albuquerque Mission:\nHorizons Albuquerque advances equitable learning opportunities for scholars. We partner with families, communities, and schools to provide a summer academic and enrichment program, as well as wrap-around supportive services for scholars and their families throughout the year. \n\n\nOur out-of-school time program serves 180 under-resourced scholars from nearly 60 public schools in 1st - 12th grade from Bernalillo, Sandoval, and Valencia counties. The need to address student achievement and opportunity gaps has never been more critical. The majority of our programmatic impact takes place during our six-week tuition-free summer program, with our primary focus on addressing the academic needs of our scholars. Traditionally, Horizons scholars gain six to eight weeks of academic gains over the summer session, full of enriched learning and opportunities they may otherwise not receive. Our scholars benefit from our unique public/private school partnership. Elementary scholars attend the summer program at Manzano Day School, middle school scholars attend Bosque School, and high school scholars attend Sandia Prep. We also offer year-round family engagement opportunities and support for our students and families. \n\nYour investment in Horizons Albuquerque directly impacts our ability to have scholars return to the program each year for project-based learning, literacy, STEM, field trips, swimming, music, art, and more in a community building and nurturing environment. Thank you!",
  "214": "## Mission\r\n\r\n### Strengthening immigrant parents, families and communities in New Mexico.\r\n\r\nEncuentro’s mission is to transform New Mexico into a thriving community for all of its residents. We do this by engaging with Latino immigrant families in educational and career development opportunities that build skills for economic and social justice.\r\n\r\nEncuentro is committed to the belief that quality education should build both individual and community knowledge, and with that __knowledge__ comes individual and community __power.__\r\n\r\n## Model\r\n\r\n### Encuentro’s Theory of Transformation through Community Collaborations\r\n\r\nEncuentro’s collaborative model demonstrates that strategic community partnerships can expand and strengthen the safety net for immigrant families; furthermore, when programs are collectively offered in a culturally relevant, justice-oriented environment, they act as entry points into leadership development and community engagement opportunities, which build social capital and promote social and economic justice.\r\n\r\n![model diagram](https://i0.wp.com/encuentronm.org/wp-content/uploads/2017/11/Encuentro-NM-Theory-of-change1.jpg?w=864)\r\n\r\n### Entry Points\r\n\r\nCommunity knowledge, leadership and engagement are essential to crafting and implementing effective public policies that will help all NM children and families to thrive. Encuentro works to raise the voice and visibility of the immigrant community, so that we can tell our own story, and join with others in the fight for social justice and for making our state a land of opportunity for all New Mexicans.\r\n\r\n### Collective Transformation\r\n\r\nLeadership development and community engagement are the desired objectives of any of good educational experience. At Encuentro, students develop and strengthen their leadership skills to support their families, schools and community. Together, we identify opportunities to collectively engage as advocates, volunteers, and strategists on the issues most affecting our families.\r\n\r\n### Community defined outcomes\r\n\r\nCommunity knowledge, leadership and engagement are essential to crafting and implementing effective public policies that will help all NM children and families to thrive. Encuentro works to raise the voice and visibility of the immigrant community, so that we can tell our own story, and join with others in the fight for social justice and for making our state a land of opportunity for all New Mexicans.",
  "215": "## How Did We Get Here?\r\n\r\nFood is Free Albuquerque began in August of 2014, almost by accident. Erin and Trista, both avid canners and food preservers, had seen many fruit trees around Albuquerque that appeared to be going unused. An ad placed on the local Craigslist asking for access to the unused fruit trees was about to play a critical role in their futures. Over the next few days the ladies, overwhelmed with all the responses, arranged their first harvest. To their surprise and delight the first pick yielded over 100 pounds of fruit; more than enough for their own families. Knowing there were other harvest opportunities, it was in that moment both knew they had fallen onto something that was bigger than them.\r\n\r\nThe Food is Free Project is a global movement started in Austin, Texas by John Vandeusen Edwards promoting front yard gardens and sharing the excess with the community. Using this project base Erin and Trista requested permission to use the Food is Free name to create their own local chapter.  A Facebook page was created, and just like that, their first harvest as Food is Free Albuquerque was complete. Discussion during harvesting lead to the \"What next?\" and \"Where on Earth would all these apples go?\" In the end, the decision was made; the first box was left at a busy city bus stop with a sign taped to it \"Free Apples.\"\r\n\r\nIt is well known that groups need volunteers. Who were theirs? Trista and Erin's combined five home-schooled children were the first to jump in line.  Often times simply playing make believe games of childhood while the crazy moms grasped for apples. The children have played a very active role in Food is Free Albuquerque from going on harvests to helping manage events. While they are now moving into their own passions, they still tell the story of our beginnings. ​\r\n\r\n_The Food is Free Albuquerque mission touches many social issues facing humans across the globe._\r\n\r\n_Food is power, and it is our mission to help give that power back._\r\n\r\n_Fresh food is a human right._\r\n\r\n[Did we just become best friends?](https://forms.gle/gTzE6R1YfpTibAmRA)",
  "220": "## Mission\n\n_Storehouse New Mexico is a nonprofit community-based food pantry that provides free food to people in need. _\n\nThe Storehouse became a nonprofit organization in 1976 with one specific goal: to help New Mexicans solve their food insecurities regardless of race, faith, age, gender, or disability. Hunger has increased over the years, and the Storehouse currently provides nutritious food to over 40,000 people a year.\n\n## History\n\nIn 1976, Titus and Charlotte Scholl, a local pastor and his wife, realized that too many people in Albuquerque were going hungry. Instead of standing by, they took it upon themselves to do something to help. They spoke to friends and family, gathered collections and began to distribute food out of the trunk of their car and occasionally their own garage. Many years later, when the Storehouse found its current home near the corner of Central and Broadway in downtown Albuquerque, the Storehouse was supporting close to 10,500 families.\n\nIn an effort to find more ways to end hunger in New Mexico, the Scholls founded the Roadrunner Food Bank in 1980. We have continued to worked closely together since then.\n\nThe Scholls, and eventually a team of volunteers, survived entirely on community support and the generous contributions of food and resources they were able to gather.\n\nAs a truly charitable organization, the Storehouse still relies almost entirely every month on the generosity of community members to remain in operation. A majority of those donations are given by individuals. Corporate gifts, foundations, and faith community donors are also vital.\n\n\nThe Scholl family wasn’t especially well known or wealthy, they were just thoughtful people who wanted to “prove someone cares”. That mindset remains part of the social fabric of the Storehouse today. Our goal is for everyone who walks through our door to get nutritious food and the caring our our team. \n\nIn 2014, the Storehouse nearly closed. To ensure we could continued to feed the multitude of families that count on us, we turned to another nonprofit for support. At that time, Adelante Development Center began to support our administrative efforts such as fundraising, marketing, payroll, IT, and HR support. This arrangement helps our small crew focus simply on feeding people in need. We remain our own corporation, but Adelante’s work has been a great support to the Storehouse. Today, we are able to give more food to each family, the number of volunteers has increased, our donations have been more stable, and we’ve been able to feed more people when the community need has risen.",
  "221": "## Heading Home provides solutions to homelessness\r\n\r\nHeading Home is a New Mexico non-profit that provides emergency housing, permanent supportive housing services and prioritized street outreach to people experiencing homelessness.\r\n\r\n## Vision\r\n\r\nWe envision experiences of homelessness as rare, short-lived and nonrecurring.\r\n\r\n## Mission\r\n\r\nIt is the mission of Heading Home to fulfill our organizational vision through a unified voice of advocacy, prevention and service; and to be an innovative convener, collaborator and educator about homelessness in the community.\r\n\r\n## Programs\r\n\r\n* [ABQ StreetConnect](https://headinghome.org/abq-streetconnect/)\r\n* [Albuquerque Heading Home](https://headinghome.org/programs-overview/albuquerque-heading-home/)\r\n* [Families Heading Home](https://headinghome.org/programs-overview/families-heading-home/)\r\n* [Albuquerque Opportunity Center (AOC)](https://headinghome.org/programs-overview/albuquerque-opportunity-center-aoc/)\r\n* [Westside Emergency Housing Center](https://headinghome.org/programs-overview/westside-emergency-housing-center/)\r\n\r\n## hous·ing /ˈhouziNG/ noun – The solution to homelessness_\r\n\r\n* Heading Home programs have collectively transitioned more than 3,000 individuals and their family members into housing since 2011\r\n* Heading Home has saved more than $6 Million in taxpayer dollars since 2011\r\n* Every year the Albuquerque Opportunity Center Campus serves more than 23,000 meals\r\n* Heading Home volunteers have given more than $70,000 worth of time over the past year",
  "222": "## The desert forge foundation was formed by combat veterans to serve fellow veterans.\n\nLike you, we served our country proudly, whether in the comfort of peace or in the midst of battle. Then one day the weapon was secured and gear was packed away one last time; it was time to head home, maybe a place not so familiar anymore.\n\nOur mission is to help our returning brothers and sisters find __employment, restoration, strength, and hope.__\n\n![Desert Forge Group](https://www.desertforge.org/uploads/1/2/7/3/127313590/published/photo-aug-08-6-43-11-pm.jpg?1568171218)\n\n## The Facts\n\nVeterans represent our nation’s highest quality human capital.  As a population, veterans possess more education and training than their civilian counterparts.  But despite being highly skilled, disciplined and trained, _over one million veterans across the country are either unemployed or under-employed._\n\nIn New Mexico approximately 6,000 recently returned combat veterans are in need of employment.\n\nIn addition, a significant percentage of our nation’s veterans have returned home  with post-traumatic stress disorder (PTSD), depression, and other related physiological problems that increase the risk of suicide.\n\n## We are building solutions ​to  generational challenges\n\nEvery day 17 veterans commit suicide. In 2016, 71 veterans in New Mexico took their own lives.  Often cited was lost hope or the isolation of unemployment or homelessness. This is a preventable tragedy.\n\nEvery year New Mexico imports over 90% of its food. With an estimated $5 BILLION spent on imported food every year, the potential of producing even a fraction of food locally would create jobs and sustain lasting economic renewal.\n\n## Desert Forge is working to solve these challenges.\n\nBy training Veterans to become Warrior Farmers, Desert Forge is helping our heroes connect with the land they fought to defend while restoring hope, creating jobs and building authentic community.",
  "243": "The Transgender Resource Center of New Mexico provides advocacy, education, and direct services in support of transgender, gender nonconforming, nonbinary, and gender variant people and their families. \n\n* [Groups](https://tgrcnm.org/groups) Most groups are operating on Zoom! Please see our Support Group page for details.\n\n* [Training](https://tgrcnm.org/training) TGRCNM offers exceptional training on transgender lives and issues for any class, workplace, or group that invites us.\n\n* [Drop-in Center](https://tgrcnm.org/) Our Drop-In Center is open Monday, Wednesday, and Friday 1-5 pm. We offer a wide variety of services and assistance. \n\n* [Food Access](https://tgrcnm.org/food-access) Our Food Access Project addresses issues of food insecurity and chronic hunger in the trans community within a social justice framework.",
  "244": "## Mission Statement\r\n\r\nTree New Mexico is dedicated to helping communities plant and care for trees in urban areas — large and small — throughout The Land of Enchantment.\r\n\r\n## Organizational History and Goal\r\n\r\nFor over 30 years Tree New Mexico (TNM) has been planting trees in the Land of Enchantment and educating the public on the value and necessity of healthy urban forests. We continue to be the premier private, non-profit tree planting organization in NM (and the nation); planting thousands of trees each year and building a high level of understanding and advocacy for the expansion and maintenance of urban forests.\r\n\r\nTree New Mexico was initially formed out of concern for the environment by local high school students on the premise that tree planting is an important and worthwhile national and community goal. Since our founding in 1990, our partners and volunteers have helped plant over 1,250,000 trees in communities throughout New Mexico. Sue Probart, Founding Director and now Board Emeritus, ran TNM for the better part of 30 years. She is generally known in NM as “Ms. Tree” and as the reason we have urban forestry at all.\r\n\r\n## Our Objectives:\r\n\r\n* Build strong and effective partnerships with all levels of public and private organizations.\r\n* Increase the canopy of urban and community forests throughout New Mexico.\r\n* Provide environmental tree-based education for citizens of all ages.\r\n* Serve as an urban and community forestry advocate.\r\n* Mitigate and reverse urban heat island effect in urban areas of the state.\r\n* Build public awareness regarding trees and the environmental role they play in our communities and the nation.",
  "257": "We Make Radio For Kids With Kids!\n\nHear our work at our \nwebsite : https://www.childrenshour.org\n\nThe Children’s Hour Inc is a New Mexico based non profit organization which creates broadcast media that is educational, entertaining and engaging, and also includes kids who participate in its creation.\n\nWe produce and distribute of high quality children’s media, that’s cultivated through community involvement and immersion. Our award winning kids public radio program, The Children’s Hour can be heard on public radio stations across the United States and Canada.\n\nOur program themes focus on four areas: STEM education, civics, cultural education and performance.\n\nWe produce our shows with a crew of active volunteer kids who we call our “Kids Crew”. Sometimes our programs are produced in collaboration with a teacher or school, as part of our RadioKids School Project. We also collaborate with teachers at schools with a Title 1 designation, or where the students experience other challenges.\n\nListener support makes the work of The Children’s Hour, Inc. possible. We also receive funding from the City of Albuquerque Cultural Services Department, the CABQ Urban Enhancement Trust Fund, a generous grant from the New Mexico’s Cultural Services Department’s New Mexico Arts and the National Endowment for the Arts, the County of Bernalillo, New Mexico, our corporate sponsors, and nonprofit foundations, private donor funds and listeners.\n\nWe’re committed to making sure kids have a voice in public radio, and we create a program that never alienates adults.\n\nWe’d love to hear from you! Send us a comment, or leave us a voice message on our voice message at [page](https://www.childrenshour.org/) and you might hear yourself on the radio!",
  "263": "## Our Mission\r\n\r\nOur mission is to connect people, earth, water and wildlife in an urban setting by farming sustainably, enhancing wildlife habitat, educating our community, and providing fresh, naturally grown food to diverse populations.\r\n\r\n## History of the Farm\r\n\r\nWhat is now the Los Poblanos Fields Open Space was purchased by the City of Albuquerque after a two-year campaign to preserve this last remaining parcel of farmland in the North Valley. Recognizing the value to the community of maintaining this agricultural space, the City passed a two-year ¼ cent sales tax to provide funds for its acquisition.\r\n\r\nThe Farm holds a special place in the history of Albuquerque. It occupies the original site of Los Poblanos, one of the earliest Spanish Colonial settlements in the Rio Grande Valley. It is, in fact, a living link in an agricultural heritage that extends over 1700 years, making it among the oldest parcels of continually farmed land in the United States. Years of hard work have transformed the neglected land into community gardens, wildlife habitat, and certified organic croplands. These provide educational experiences, community service projects, recreation and entertainment to a broad segment of our population while honoring our history and protecting the environment. Recent studies have shown that agricultural lands contribute significantly to recharging Albuquerque’s aquifer. As our population grows and as water becomes more scarce, it becomes increasingly important to preserve agricultural lands in order to safeguard our quality of life.",
  "283": "Rio Grande Food Project (RGFP) is a food pantry, urban garden, and community hub. Our mission is to alleviate hunger and cultivate long-term food security in our communities.\n\nRGFP is the largest food pantry on Albuquerque's westside and distributes non-perishable foods as well as fresh, locally grown produce 3 days per week to low-income individuals and families facing food insecurity.\n\nOur community hub assists with electric and water bill assistance, connects people with employment opportunities, offers free emergency phones, and distributes free books for kids and other household maximizing items such as the PNM Easy Savings Kit.\n\nOur urban garden was recently expanded in 2023 and grows a variety of fruits and vegetables which are harvested, weighed, and immediately distributed at our food distributions.",
  "311": "At Rio Grande Educational Collaborative, it’s our goal to help kids find their way to success through the development, application, and management of innovative programs that build on traditional education. We offer unique after-school learning programs that are geared towards extended learning. In addition to offering dedicated daily homework help, a key aspect of our program is the enrichment learning opportunities we provide through our own lesson plans.\r\n\r\nAll of our programs are located onsite at your child’s school, making it convenient for parents by allowing for effective communication with school staff. Our team meets with the school’s principal to learn where the school is strong academically, as well as to identify areas in which they’d like to offer more. RGEC then customizes our after-school program to help augment the school’s areas of weakness. Learning may include lessons in science, math, geography, literacy, and the arts. We also incorporate subjects that the school may have had to drop or minimize due to lack of funding, like music, fine art, performing arts and sports. Students begin their afternoon at RGEC with a snack or a lite meal right as soon as the school day has finished. Each after-school program is divided into two parts: homework help and enrichment time. During homework help, students are grouped with their grade level and may work on their homework on their own, or with the help of program educators. A key aspect of our programs is that they reduce the burden of homework on busy families, and increase the amount of family time each night. Students will finish homework before parents pick them up, freeing parents to focus on making dinner and talking with their children about the school day.\r\n\r\nNext, kids get to break into groups for our enrichment classes, which are fun, enhanced learning designed to augment the school’s existing curriculum. During enrichment time, students will participate in planned group lessons and activities that have been selected to expand on the core subjects they learn in school. Kids are grouped by grade level, and the groups alternate between academic subjects like literacy, science and math, and other topics like entrepreneurship, nutrition, physical wellness and dramatic arts to name a few. These activities include reading and math practice that are part of our “disguised learning” methods. All lessons are planned, structured, led by our trained instructors and many are also teachers and educational assistants at your child’s school. All our program instructors are certified in CPR and First Aide and must pass a CYFD background check. Our programs are licensed through the New Mexico Children, Youth and Families Department to ensure that a high level of safety standards exist and the best practices are followed, providing a safe program for your child. RGEC’s program instructors provide children with a fun, nurturing program that is essentially an extension of their own family through guidance, inspiration and motivation.",
  "321": "## Our Mission\r\n\r\nTo be a catalyst for positive change by engaging citizens in policy and enabling action.\r\nOur Core Values\r\n\r\n* Meaningfully engaging New Mexicans in public policy\r\n* Striving for and respecting consensus\r\n* Pursuing and respecting diverse points of views\r\n* Ensuring inclusion and transparency\r\n* Rising above partisan politics\r\n* Changing policy to improve people's lives\r\n* Creating an informed citizenry that is powerfully motivated\r\n* Reaching out statewide including rural and tribal communities\r\n* Partnering with others\r\n* Promoting civility\r\n* Democracy at its best\r\n\r\n## About New Mexico First\r\n\r\nNew Mexico First builds consensus on critical issues facing our state and communities and leads positive policy change through deliberative town halls, forums, and nonpartisan work on education, the economy, healthcare, natural resources and good governance. New Mexico First is a 501(c)(3).\r\n\r\nOur mission statement and core values provide the ethical framework for all our work.\r\n\r\nOur state’s two U.S. Senators – Tom Udall and Martin Heinrich – serve as New Mexico First’s honorary co-chairs. The organization was co-founded in 1986 by U.S. Senator Jeff Bingaman (retired) and the late U.S. Senator Pete Domenici.",
  "368": "Together for Brothers (T4B) believes young men of color (YMOC) are, can and should be leaders at all levels in their community.\r\n\r\nT4B's model makes spaces for YMOC to practice that leadership in their schools and communities. YMOC with T4B are redefining what it means to be brotherly.\r\n\r\n## Youth Organizers\r\n\r\nYouth Organizer and Lead Youth Organizers are young men of color who lead a cohort and circles in their community or neighborhood. Youth Organizers participate in an internship and gather weekly to build relationships and learn to facilitate a circle and organize in their communities.\r\n\r\n## Community + Neighborhood Based Cohorts + Circles\r\n\r\nSince Winter 2016 T4B has hosted cohorts and circles for Youth Leaders - participants - in our three seasons: Winter (January-April), Summer (May-August) and Fall (September-December) for self-identified young men of color who especially live, work, play, pray or learn in the International District (87108 and 87123) and Westgate (87121).",
  "377": "## Our Mission\n\nThe main focus of Street Cat HUB is feral cat and colony population control using humane alternatives to euthanasia, such as TNR (trap, neuter & return). Street Cat HUB’s founder and current Board President, Jayne Sage, began trapping community cats in her neighborhood in 2001. She started a trap loan program in 2009 to expand services beyond her immediate area. In 2012, Best Friends provided funding for a startup program based out of Jayne’s property, and by design, Best Friends exited the program in 2014.\n\n![closeup of a cat](https://images.squarespace-cdn.com/content/v1/5e389e57a5944945a0f92994/1581044971280-S934I8C8CMTRM7XN33JG/ke17ZwdGBToddI8pDm48kFyD7pzB8zoMIVY5aiUuFlp7gQa3H78H3Y0txjaiv_0fDoOvxcdMmMKkDsyUqMSsMWxHk725yiiHCCLfrh8O1z4YTzHvnKhyp6Da-NYroOW3ZGjoBKy3azqku80C789l0jG2lbcDYBOeMi4OFSYem8DMb5PTLoEDdB05UqhYu-xbnSznFxIRsaAU-3g5IaylIg/shutterstock_1305764047.jpg)\n\n__Street Cat HUB’s mission is to serve the city of Albuquerque and  surrounding areas with the spay and neuter of free roaming cats.__\n\n![closeup of a cat](https://images.squarespace-cdn.com/content/v1/5e389e57a5944945a0f92994/1580921632410-RL13PLC8JVJ9WYM2U8HA/ke17ZwdGBToddI8pDm48kNnXr6aOSeKpN_pOojTpHsR7gQa3H78H3Y0txjaiv_0fDoOvxcdMmMKkDsyUqMSsMWxHk725yiiHCCLfrh8O1z4YTzHvnKhyp6Da-NYroOW3ZGjoBKy3azqku80C789l0p4Wyba38KfG317vYluk4592i8kx2SaGcLuKyt-_2YxHwtR8tefOfaiuQm2Q2uBM6Q/shutterstock_263415872.jpg)\n\nStreet cat Hub was founded on August 5, 2014, with a mission to serve the city of Albuquerque and surrounding areas with the spay and neuter of free roaming feral and community cats. Street Cat Hub is contracted with the City of Albuquerque and Bernalillo County to provide trapping, spay/neuter, and release/return to field services to any free roaming cat in these areas, and provides these services to out of area cats as often as funding allows. The organization provides services for between 3,000 and 4,000 cats annually, and the TNR program has resulted in a reduction in cat euthanasia numbers at our city shelter from 7,225 in 2009 to 288 in 2019. Street Cat Hub also runs foster and adoption programs to place suitable adoption candidates into homes instead of returning them to the streets, with about 20% of trapped cats being re-routed to adoption outcomes.",
  "383": "The Grief Center of New Mexico (GC) offers free support groups for bereaved children (ages 5 – 25) their caregivers and adults and is the only such program in central New Mexico.\n\nGC provides a safe place to share experiences and feelings while grieving a death. Children ages 5 and up, teens, young adults, caregivers, and adults attend GC.  Children's groups are designed to give them the opportunity to talk, draw, write, play, or act out their grief journey and to process these experiences with others who are going through the same thing.  Activities are appropriate to each age group but may include an art project, a puppet show choreographed by the kids, reading children’s stories about different kinds of death, writing personal stories about the death, etc.  Group guidelines let each child know they can always “pass” if they feel they aren’t ready for an activity.\n\nAdult groups are based on the relationship of the person who died (i.e Partner Loss Group) or the circumstance of the death. \n\nGroups are held in person for children and adults and online for adults only. \n\n[Here is a video that shows more.]\n\nhttps://www.youtube.com/watch?v=0RlwDvThp5Q\n\n",
  "390": "## Our Goal\r\n\r\nWe believe that we are stronger together, and that everyone should have access to culturally tailored care. If you or anyone you know needs support, our trained staff members are multilingual in languages such as Mandarin, Cantonese, Vietnamese, Japanese, Urdu, Dari, and Farsi. For other languages, we bring in trained community interpreters or utilize phone interpretation so that you can receive the best care in the language you are most comfortable.\r\n\r\n## Services\r\n\r\nMake an appointment today to meet with one of our case managers to get connected to resources and services. We offer individual and family counseling, legal consultation and representation, general navigation services, yoga and body work for survivors, and warm referrals to trusted agencies to qualified individuals. All of our services offered in-house are provided free of charge. Although our services are open to everyone, our offerings are tailored to those who identify as Asian, Pacific Islander, and Native Hawaiian (APINH).\r\n\r\n## Programs\r\n\r\nOur programs help to further our mission and are led by those most impacted by the work. We invest in leadership programs for youth, parents and child caregivers, and victims and survivors of violence; engage in year-round civic engagement work that increases representation of APINH immigrant, refugee, and American citizen voices; provide financial education workshops; and provide a monthly gathering for young women, gender non-conforming, and non-binary folks identifying as APINH through Tea Talks.\r\n\r\n## About Us\r\n\r\nNMAFC was founded in 2006 by a circle of Asian women who came together to address the lack of culturally and linguistically tailored services for the state's Pan-Asian community. Having started by providing counseling and case management services in a house, NMAFC has now grown to include survivor led and centered services, programs centering traditional methods of healing, youth and community leadership programs, financial education workshops, cross-racial movement building,and civic engagement work.\r\n\r\nWe believe the solutions to our issues lie within the deep wisdom and experiences of our communities, and that our organizational leadership, as well as our programs and services, should be reflective of this. We are continually striving to frame our work within a social justice lens, and believe that all children and families deserve equitable access to resources and opportunities in order to thrive. All of our services and programs are offered in multiple Asian languages. We utilize phone interpretation and community interpreters for languages not spoken in-house.",
  "398": "The South Valley Economic Development Center is dedicated to fostering economic revitalization in New Mexico by being the community hub for new and emerging businesses. The SVEDC is an initiative of the economic development efforts of the Rio Grande Community Development Corporation.\n\n## Business Incubation Programs\n\nOur Incubation Programs offer a nurturing environment to help an idea grow into a thriving business by providing indispensable business support and access to essential amenities that the SVEDC facility provides.\n\n## Small Business Support\n\nOur program offers a wide range of trainings, services and networking events that are recognized as essential for new and existing entrepreneurs. Our partner organizations help support these trainings by providing classes and networking opportunities that allow your small business to grow, expand, and network.\n\n## History\n\nAt the beginning of the Bridge and Isleta Boulevards Revitalization planning sessions in 1996, community residents recommended that a small business incubator be built to address economic development issues in the South Valley. In response to the request, the Rio Grande Community Development Center (RGCDC) developed the Bridge and Isleta Boulevards Revitalization plan. The plan made the development of a business incubator in the South Valley a priority. In addition to traditional business incubation, the plan also identified the economic development benefits of locating a commercial kitchen within the facility. The commercial kitchen would provide value added opportunities for residents involved in local farming and food production.\n\nThe University of New Mexico’s Design and Planning Assistance Center (DePAC) provided the initial designs for the project. The project secured funding from the U.S. Department of Housing and Urban Development through the University’s Resource Center for Raza Planning, then directed by Teresa Cordova.\n\nThe Resource Center for Raza Planning also conducted door-to-door interviewing and surveying to determine ongoing community support and to gather suggestions for the facility’s development. Based on South Valley residents’ responses to these surveys and community planning meetings, the community decided to name the project the South Valley Economic Development Center (SVEDC). RGCDC and community based efforts made it possible to break ground for the “South Valley Economic Development Center” in 2003 and construction was completed in 2005. The SVEDC’s Grand Opening took place in the summer of 2005.",
  "405": "## At our core\r\n\r\nWorking Classroom is a 30-year-old arts and social justice non-profit in Albuquerque, New Mexico that cultivates the artistic, civic, and academic minds of youth through in-depth arts projects with contemporary artists to amplify historically ignored voices, resist systemic injustices, and imagine a more equitable society.\r\n\r\n## Our values\r\n\r\nWe believe the arts both mirror who we are as a nation and help us interpret where we are headed and what we want to become. As long as some communities are invisible or underrepresented, the reflection is distorted and the conversation incomplete. Working Classroom prepares students to contribute to a more nuanced definition of our collective identity.\r\n\r\n* __We value__ the strong, fresh and unique voices that youth bring to art and social justice movements.\r\n* __We prioritize__ collaborations with artists, youth & communities who have been historically underserved & underrepresented in power.\r\n* __We support__ youth as agents of change by using contemporary artistic expression – visual art, new media, public art, and theater to create work that tells our communities’ stories with truth, nuance, beauty and power.\r\n* __We know__ that art has the power to heal and disrupt isolation and systems of oppression.\r\n* __We value__ high quality, contemporary, art, collaborating with and challenging emerging artists from a place of love and respect.\r\n* __We know__ that training young artists from underrepresented communities contributes to a more complete and nuanced understanding of our world.\r\n* __We value__ conscious rule breaking and the individual and collective growth that comes from taking risks, pushing boundaries and colliding with the status quo.\r\n* __We recognize__ the need for safe spaces for expression, self-discovery and inquiry.\r\n* __We value__ connectivity across intersecting identities as well as collaboration with schools, community-based organizations, and arts organizations.\r\n* __We believe__ that artists labor has both cultural and financial value, to that end, we pay professional artists for their work and provide paid opportunities for student artists.",
  "415": "Founded in 1976, New Day has been serving and supporting young people in the Albuquerque area for over 45 years. Our mission is to authentically connect young people to safety, the community, and themselves. Our vision is a world where all young people’s unique identities and talents complete and strengthens the social fabric of our community.\n\n​We only work with young people who are 11-25 and develop services and supports that align with their diverse experiences and needs. Our focus is on creating spaces that are safe and that help young people feel seen and honored. We know this is the first step in building and strengthening young people’s internal resources and empowering them to live out their dreams. New Day works with over 900 young people who experience marginalization, disconnection, and homelessness every year.\n \nAt New Day, we see the greatest successes when we’re able to help young people find deep connections to safety, the community, and to themselves. They must be recognized for who they are, empowered to discover their own qualities of greatness, and strengthened to take on the hardships of adulthood. This is the work of New Day.\n \nSuccess looks different for everyone and we are so proud of each person who has come through New Day. ",
  "467": "Your donation feeds people throughout Albuquerque and Rio Rancho who are hungry and home-bound. Thank you! \n\nSince 1972, Meals on Wheels of Albuquerque has provided hot, freshly-prepared meals to anyone who is unable to cook for themselves. \n\nYour gift provides food and wellness checks for people in need. More than 550 Volunteers deliver meals across the community each day, Monday through Friday.\n\nOur mission is \"Nourishing bodies and spirits with balanced meals and friendship.\"\n\n## More about Meals on Wheels…\n\nMeals on Wheels of Albuquerque is the only home delivered meal program in our area that prepares special diets. We prepare these special diets for a variety of needs, including diabetes, renal failure, heart issues, chewing and swallowing problems, etc.\n\nThrough grants, donations, and the support of the community, we started the Low Income Food & Enrichment Program (L.I.F.E.). This program is for those meeting the federal government’s defined poverty level and who require a special diet due to health issues.\n\nThere are no restrictions for age or disability. We currently have clients in their 20’s to our oldest client who just celebrated her 109th birthday. We can provide meals for any duration whether they are needed during a period of recuperation or for many years.\n\n## History...\n\nMeals on Wheels of Albuquerque is a private 501(c)3 nonprofit corporation founded in 1972 by a group of women from Presbyterian Churches around Albuquerque. We began with 20 clients and 40 volunteers. Today we serve approximately 500 clients and have over 400 volunteers. We delivered 9,400 meals in 1972. Today we are delivering over 140,000 meals a year. Meals on Wheels of Albuquerque provides nutritious meals and crucial social contact each day. Not only do we provide friendship and compassion but we also check the well being of those we serve.\n\nVisit our website for more information - https://mow-nm.org/ ",
  "470": "The Supportive Housing Coalition of New Mexico (SHC) was founded in 1996 in response to local service providers’ recognition of a community-wide gap in safe and affordable housing for homeless and near-homeless persons with behavioral health disorders. Founding agency members were: Albuquerque Health Care for the Homeless, St. Martin’s Hospitality Center (now Hopeworks), Transitional Living Services (now Therapeutic Living Services), and University of New Mexico Psychiatric Center. SHC later welcomed the New Mexico Veterans Administration Medical Systems of Albuquerque as a member.\r\n\r\nSHC’s mission is to end homelessness by providing affordable, permanent, and supportive housing to individuals and families in New Mexico. We believe affordable and supportive homes are the foundation to healthy families, vibrant neighborhoods and strong communities.\r\n\r\nSHC specializes in the development, ownership and management of supportive housing while our community partners refer and place residents and offer a comprehensive range of supportive services to optimize the health, recovery, independence and housing stability of our residents. Formal collaboration has enabled SHC and its partnering agencies to pool resources, reduce competition, better coordinate service delivery, increase efficiencies, and embrace a broader strategy for creating supportive housing.\r\n\r\nThrough new construction, property acquisition, rehabilitation, and the administration of tenant based rental assistance vouchers, SHC has grown to encompass 700 units of housing. The organization owns, manages, and/or provides supportive services for seven affordable multi-family properties consisting of 349 units that are utilized for affordable and permanent supportive housing in New Mexico. Through its Community Housing Program, SHC administers over 350 tenant-based rental assistance vouchers, using a Housing First model, for formerly homeless individuals with behavioral health issues, including substance abuse and severe mental illness, and for individuals exiting incarceration. Housing & Services Coordinators connect participants with special needs to resources needed to ensure housing stability, increased income, and improved quality of life.\r\n\r\nCurrently Owned and Managed Properties\r\n\r\nThe following is a list of affordable and supportive housing projects developed and managed by SHC:\r\n\r\n* Vista Gallinas, 2525 Ridge Runner Road, Las Vegas, NM. a HUD Section 811 development consisting of fourteen one-bedroom, one two-bedroom unit for an onsite manager and a community center for persons with disabilities with incomes at or below 30% AMI.\r\n\r\n* Downtown @ 700-2nd, 700-2nd Street NW, Albuquerque, NM. This is a Low-Income Housing Tax Credit project that combines mix-income households, supportive housing and sustainable green design elements. The project offers 72 single room occupancy (SRO) units in downtown Albuquerque for low wage workers, persons with disabilities, formerly homeless persons. The project won a statewide design competition by our state housing authority and recently was recognized for “Innovations in Planning” from the American Planning Association.\r\n\r\n* Silver Gardens I & II, 100 Silver Avenue SW, Albuquerque, NM.  This is a 121 mixed-income affordable housing project developed in partnership with Jonathan Rose Companies. SHC-NM is the nonprofit partner in the project and provides supportive services for special needs tenants in 21 units.\r\n\r\n* Redlands Apartments at 5901 Redlands Road, NW, Albuquerque, NM. This is an 18-unit HUD 811 project that provides permanent housing for persons with disabilities.\r\n \r\n* Sunport Plaza Apartments, 1313 Wellesley Avenue, SE, Albuquerque, NM. This is an 80-unit affordable housing complex for persons at or below 50% area median income.\r\n \r\n* Chuska Apartments, 2534 E. Aztec Avenue, Gallup, NM. This is a housing tax credit project that combines mixed-income households, supportive housing and sustainable green design elements. Chuska Apartments combines 10 permanent supportive housing units for chronically homeless families and 20 permanent affordable housing units for families at or below 60% of the area median income. Chuska Apartments includes one-story residential buildings with a mixture of two- and three-bedroom apartments.\r\n\r\nPrevious Projects/Properties\r\n\r\n * West Central Apartments, 5817 Central Avenue, NW, Albuquerque, NM. This is a 12-unit market rate complex that is marketed at an affordable rate and accepts Section 8 vouchers.\r\n \r\n* Chelwood Apartments at 1209 Chelwood Park Blvd, NE, Albuquerque, NM. This is a 4-unit re-entry crisis housing project for individuals with mental disabilities who are recently discharged from hospitals, institutions or correctional facilities. It can house up to 6 residents at any given time. Tenants can stay up to 60 days.\r\n\r\n* Independent Living, 4223 East Central Avenue, NE, Albuquerque, NM. This is an 11-unit independent living project that provides permanent housing for persons with disabilities. Rents are maintained at below-market rates with some units capped at 30% of the tenant’s income.",
  "485": "Every child deserves a chance to see their potential realized. By matching children one-to-one with adult mentors (or Bigs), Big Brothers Big Sisters defends that potential. And helps change lives today and forever. All it takes is just a few hours a month. Join us. Become a Big now.\r\n\r\n## About Us\r\n\r\nFor more than 100 years, Big Brothers Big Sisters has operated under the belief that inherent in every child is the ability to succeed and thrive in life. As the nation’s largest donor- and volunteer-supported mentoring network, Big Brothers Big Sisters makes meaningful, monitored matches between adult volunteers (“Bigs”) and children (“Littles”), ages 6 through 18, in communities across the country. We develop positive relationships that have a direct and lasting effect on the lives of young people.\r\n\r\n__The Big Brothers Big Sisters' Mission__ is to create and support one-to-one mentoring relationships that ignite the power and promise of youth.\r\n\r\n__The Big Brothers Big Sisters' Vision__ is that all youth achieve their full potential.\r\n\r\n__Accountability:__ We partner with parents/guardians, volunteers and others in the community to hold ourselves accountable for each child in our program achieving:\r\n\r\n* Higher aspirations, greater confidence and better relationships\r\n* Avoidance of risky behaviors\r\n* Educational Success",
  "493": "The NACA Inspired Schools Network (NISN) is building a movement of students, families, and educators to create excellent schools relevant to the communities they serve. NISN works with fellows who are committed to Indigenous communities to establish schools in New Mexico and throughout the country that will create strong leaders who are academically prepared, secure in their identities, healthy, and ultimately transforming their communities.\r\n\r\n## Community-led design is the model.\r\n\r\nNISN supports leaders in Indigenous communities to develop a network of schools providing rigorous academic curriculum aimed at college preparation while also promoting Indigenous culture, identity, and community investment.\r\n\r\nThis is not a cookie-cutter approach to schools. Each community has different assets and desires for their next generation, so fellows and schools must be in tune to what those needs are and responsive to them. \r\n\r\n## Initial Planning & Team Development\r\n\r\n* At least a full year of intensive planning prior to school launch by Founder/ Principal & small start-up team\r\n* Having a mentor school for technical assistance and as liaison\r\n* Mapping out and capitalizing assets of organizations/ leaders with common vision\r\n* Spend significant time researching, gathering inputs from, and building partnerships with organizations doing quality work in Native education, with local businesses, and with leaders in government\r\n\r\n## Community Engagement\r\n\r\n* Community Advisory Council-Each group had a specific areas of expertise to participate in planning and development of the school’s curriculum and programs: Wellness Philosophy, Curriculum Development, Governance Council, Family Outreach, Out of School Time /Community Partnerships.\r\n* Having forums and focus groups led by a full-time outreach organizer / facilitator to engage the community and parents and garner their support\r\n\r\n## Governance & Leadership\r\n\r\n* Integrating the community in school leadership and organization\r\n   * NACA's leadership and organization structure explicitly integrates the community into school’s ongoing program development and activities (e.g., Governing Council, Tribal Relations Dean, Director of Enrollment and Community Relations, Student Support Program Director, Director of OST, External Partnerships)\r\n* School serving as the leader in convening the community with active communication, programs, and events NACA hosts, among other events, an annual Pow-wow and Feast Day drawing over one thousand individuals to the campus on a twice-yearly basis.\r\n\r\n## Curriculum\r\n\r\n* Integrated-curriculum combining culture, community, and wellness philosophy with rigorous academics\r\n* Curriculum Advisory Teams along critical elements of curriculum focus\r\n* Advisory Program providing every student with an Advisor who is an advocate for the student and allows the students to develop a “positive relationship with an adult”\r\n* “Wellness Wheel” as a framework/ tool for ensuring students’ holistic wellness and growth\r\n\r\n## Program & Services\r\n\r\n* School as a hub for robust community partnerships for success of students and families\r\n* For example, NACA works with many community partners through various programs supporting students, families and neighborhood community with some partners co-located or having the staff based within NACA campus\r\n  * All programs clearly aligned with NACA’s mission and wellness philosophy\r\n\r\n>> _“This is a chance to revitalize community and culture, foster cultural competence, and create lasting positive change._\r\n\r\n>> — Kayla Begay (Diné), NISN Fellow and Founder of the Dził Dit Ł'ooí School of Empowerment, Action and Perseverance (DEAP) in Navajo, NM",
  "503": "Pegasus was founded in 2002 by two Albuquerque lawyers, Tara Ford and Liz McGrath. Both attorneys worked as lawyers for children and youth in foster care and had seen the benefits of having a skilled lawyer to advocate for these children. Their experience led them to believe that children and youth outside of the foster care system would also benefit from access to legal services.\r\n\r\nPegasus provides civil legal services to children and youth in dire situations. Most of the clients we serve have suffered extreme hardships such as abuse and neglect. Pegasus is committed to helping them find positive, long-term solutions. We offer a unique range of services to homeless and runaway youth, teen parents, children in the abuse/neglect system, children being raised by their grandparents, and children who have been denied appropriate educational services. Pegasus prides itself on providing comprehensive, high quality legal services to children and youth in New Mexico.\r\n\r\n## Our Services\r\n\r\n### Education Law\r\n\r\nPegasus provides legal representation to families seeking to enforce their children’s right to a free, appropriate, and meaningful education, focusing on the needs of children with disabilities. Pegasus also works with child protective services and the judiciary to ensure that the educational needs of children in foster care are met.\r\n\r\n### Kinship Guardianship\r\n\r\nPegasus provides legal services to grandparents and other adults taking care of children whose parents are unable or unwilling to provide them with proper care.\r\n\r\n### Youth Law Project\r\n\r\nThe Pegasus Youth Law Project provides legal representation to youth on a range of legal issues including emancipation, family law for young parents, access to health and mental health care, and helping youth transition from foster care to adulthood.\r\n\r\n### Child Abuse and Neglect\r\n\r\nPegasus works as Guardian ad Litems (GALs) – children’s attorneys who represent the best interests of the child – and youth attorneys for young people over age 14, in the 2nd Judicial District and the specialized ICWA court.\r\n\r\nGALs are appointed by the court. We cannot enter into a case on our own.\r\n\r\n### Systemic Advocacy\r\n\r\nPegasus Legal Services for Children works with policy makers to ensure that children’s needs and rights are taken into consideration in the development of state and local laws, policies and regulations.",
  "518": "## HopeWorks is the largest nonprofit organization in New Mexico providing comprehensive services to people experiencing homelessness or near-homelessness, helping them have what they need to exit their homeless episodes for good. \n\nEvery year, approximately 10,000 people come to HopeWorks for help. \n\nHope is a powerful word, and combined with Works, our name signifies a new beginning for our clients, but one that requires thoughtful, deliberate action. Our clients take an active role in becoming independent and self-sufficient. We give them the tools to live the life they deserve, but they must always remain hopeful that a tide will turn, a barrier will fall. Light is at the end of the tunnel.\n\nWe have a solution, which includes addressing all of the underlying factors that lead to homelessness, such as centuries of systemic oppression, severe lack of affordable housing, mental/behavioral health challenges, substance use, and more.\n\n## Bringing hope to thousands in Albuquerque, and beyond.\n\nThere is only one solution to ending homelessness—housing (National Alliance to End Homelessness, 2018).  In addition, systems of coordinated care must be in place in order to ensure that our clients, especially those suffering from mental illness, have the support they need to stay housed.\n\n__For over thirty-five years, HopeWorks has been housing individuals experiencing homelessness, as well as providing them with the wraparound care they need to stay healthy, happy, and housed.__",
  "523": "We purchase special playground equipment for children with physical disabilities for their neighborhood parks, homes and schools. Our organization website is [everyabilityplaysproject.org](https://everyabilityplaysproject.org) if you want to see what we do.\r\n\r\nHere is a little about our next project, and how much money Every Ability Plays Project has to raise. \r\n \r\nOur first project of 2022/2023 will be purchasing the We-Go-Swing Wheelchair swing for Casa Angelica. Casa Angelica is a home that houses 16 children, and young adults with very special needs. Casa Angelica also has their own day program called Art from the Heart, that serves their young adults. They offer a full range of therapies for their residents. People can also go volunteer at this special home. I am so excited about this project, because I volunteered at Casa Angelica for three years. I did a lot of hand over hand things with the young adults, and or, I would read to them. One time, they had me make a paper communication system card for one of my young adults. It was cool. This special home is located in the South Valley, and it is operated by the Canossian Daughters of Charity. This whole project will cost $79,000.  We have raised $27,270 for this special project.\r\n\r\nOur second project will be redoing the school playground at Colinas del Norte Elementary School in Rio Rancho, New Mexico. They want their playground to be accessible for their side by side students. Every Ability Plays Project has offered to purchase a wheelchair swing, 2 adaptive swings, a slide and putting them a playground ground so that it can be easier to push their students who are in wheelchairs. This school playground project will cost $336,202.",
  "529": "Global Ties ABQ is a nonprofit with over 35 years of experience connecting Albuquerque and the world. In partnership with the U.S. Department of State, we bring emerging leaders from around the world to New Mexico to build global connections right here at home.\r\n\r\n![global ties team](https://www.globaltiesabq.org/wp-content/uploads/2020/08/la-plazita-2.jpg)\r\n\r\nGlobal Ties ABQ engages an extensive network of local individuals, families, nonprofits, businesses, academicians, and government offices that exchange with international leaders. Our members and community partners open their homes and workplaces to host dinners and talk business or issues of the day.\r\n\r\n![global ties members](https://www.globaltiesabq.org/wp-content/uploads/2018/12/00100dPORTRAIT_00100_BURST20181007184149605_COVER.jpg)",
  "554": "## Who We Are\r\n\r\nWe are the trusted advocates for children and their families affected by trauma.  We focus on the prevention, intervention, investigation and treatment of childhood trauma. As a Children’s Advocacy Center(CAC) accredited by the National Children’s Alliance we provide a child-friendly facility where law enforcement, child protection, family advocacy, therapy, and training offer children and their caregivers safety and a road to healing and recovery.\r\n\r\n## What We Do\r\n\r\nWe are a behavioral health agency specializing in the treatment of families, children and their caregivers who are struggling due to issues of divorce, homelessness, child abuse/neglect, family violence or other crises. Our highly trained staff specializes in trauma-informed treatment methods that create a safe and comfortable environment in which our clients can heal. We serve children, youth and their families struggling with mental and behavioral health issues that impact their success at home, school and in their community.\r\n\r\n## Children's Advocacy Center\r\n\r\nA Children’s Advocacy Center is a child-friendly facility in which law enforcement, child protection, prosecution, mental health, medical and victim advocacy professionals work together to investigate abuse, help children heal from abuse, and hold offenders accountable.",
  "578": "## Shelter and Support\r\n\r\nBarrett House provides shelter and supportive services to women and children experiencing homelessness. As one of our volunteers said, “These are the women and children who don’t have a safety net to catch them.” \r\n\r\nBarrett House creates an opportunity for them to get a safety net in place to build the stability they need to start their journey toward securing a home for themselves and their children.\r\n\r\n> “It is my hope you will understand how important of a role Barrett Foundation played in my life. Barrett enabled me to have an opportunity to grow and prosper and to find my way out of the cycle I was in. I am forever grateful.\"\r\n- Former Barrett House Resident\r\n\r\n## Housing Programs\r\n\r\nBarrett Foundation, Inc. also runs five housing programs for individuals and families aimed at building self-sufficiency and breaking the cycle of homelessness. For more information visit [our programs page](https://www.barrettfoundation.org/programs).\r\n\r\n## Our Mission\r\n\r\n## Our Mission\r\n\r\nTo end the experience of homelessness for women and children in our community by providing shelter, housing and supportive services.\r\n\r\n[Learn More](https://www.barrettfoundation.org/programs).\r\n\r\n## Our Impact\r\n\r\nBarrett House shelter serves  approximately 300 women and children each year; provides 34,000 meals, more than 11,000 bed nights, and over 1,000 hours of case management focused on helping women and families obtain stable housing.  To see our impact for the 2019-2020  year visit [Our Impact page](https://www.barrettfoundation.org/appeal).",
  "588": "## Keeping Families Close\r\n\r\nProviding family housing, meals, and support, just steps away from patient care.\r\n\r\nOur houses provide overnight stays to families seeking lifesaving treatments at local area hospitals. The guest rooms provide safe and comfortable spaces for families to rest and recharge together following long days at the hospital. More than a roof over their heads, these accommodations relieve families of the stresses of finding a place to stay while far from home. This allows parents to be stronger partners in their children’s critical care.\r\n\r\n## RMHC History\r\n\r\nWorking as a pediatric oncologist at the Children’s Hospital of Philadelphia in the 1970s, Dr. Audrey E. Evans saw families spend night after night in the hospital while their children received life-saving medical treatment. She knew there had to be a better way and envisioned a house where families could stay during these stressful and uncertain times.\r\n\r\nAt the same time, the Philadelphia Eagles were raising funds in support of player Fred Hill, whose daughter, Kim, was in treatment for leukemia at St. Christopher’s Hospital for Children. Eagles’ General Manager Jimmy Murray approached St. Christopher’s about making a donation, Dr. Lawrence Naiman suggested there was an even greater need for funds resting with Dr. Evans. Mr. Murray met Dr. Evans and became a champion for her cause. He reached out to Eagles advertiser, McDonald’s, with the idea that they could offer the proceeds from their Shamrock Shake sales to benefit this new house. McDonald’s agreed, and the Philadelphia Ronald McDonald House was born on October 15, 1974. Today there are over 375 Ronald McDonald House Programs in 65 countries and regions across the world.\r\nvintage picture of sign telling of future ronald McDonald's house under construction\r\n\r\n## Local History\r\n\r\nOur Ronald McDonald House was a vision conceived in 1979 by a collaboration of three Albuquerque hospitals, as well as medical groups, private citizens, and the Junior League of Albuquerque. Seed funding ($25,000) from McDonald’s Ray Kroc Fund was just the beginning. The group incorporated and established a volunteer board. The Junior League pledged time and money to build the House. Following extensive real estate searches, a 50-year lease was awarded by the UNM Board of Regents for the present site on UNM North Campus. The Ronald McDonald House on Yale Boulevard opened on October 30, 1982, with eight guest rooms. Eighteen months later, the House was already too small, and plans began to expand to meet the community need for family services. By December 1985, 10 bedrooms, 10 baths, a large living room, two solariums, more laundry space, and another kitchen were added. In March 1996, we began serving the community as Ronald McDonald House Charities of New Mexico (RMHC-NM) with a mission to provide temporary housing to families with ill children. In 2007, we opened the Ronald McDonald Family Room at UNM Children’s Hospital, where we provide respite services outside the walls of the Ronald McDonald House. A year later, we completed the latest House expansion, increasing the number of family guestrooms from 18 to 30. The House now has the capacity to provide nearly 11,000 family lodging nights annually. Over the last several years, demand for RMHC-NM’s support has increasingly exceeded its capacity, which means more and more families who hope to stay at the House are turned away because it is full. To address this critical need, a second Ronald McDonald House facility, the Highlands House, was opened across the street from Presbyterian Hospital within a Marriot SpringHill Suites Hotel. This first-of-a-kind endeavor provides an additional 20 guest rooms to our lodging program, allowing RMHC-NM to serve an additional 640 families annually.",
  "590": "Alta Mira supports individuals with intellectual and developmental disabilities of all ages.  We truly believe everyone in our community “Deserves a Chance to Fly”!\n\n## Our History\n\nAlta Mira is a 501c3 nonprofit organization that was incorporated in 1985 following the consolidation of two predecessor agencies, Albuquerque Special Preschool and Esperanza Para Nuestros Ninos. Both of these agencies were founded in 1968 by parents of children with developmental risks, delays and disabilities, to develop quality services within the community.\n\nSince 1985 Alta Mira has continued the work of these organizations. As the knowledge base for supporting families has changed over the years so has Alta Mira, but we have maintained the core values on which we were founded – client care and respect for families as experts.\n\nAlta Mira provides both Early Childhood Services (for children age zero-three) and Family Support Services.\n\n## Our Mission\n\nAlta Mira Specialized Family Services, Inc. supports individuals with intellectual/developmental risks, delays or disabilities and their families to optimize quality of life.\nOur Vision\n\nAlta Mira Specialized Family Services is a nonprofit organization that serves people of all ages with developmental risks, delays or disabilities throughout their lives.\n\n- We believe that these issues affect not only the person, but the family and the community, too.\n- We respect the family as the expert — empowering, validating and encouraging family members to be confident advocates.\n- We promote inclusion for people with developmental risks, delays or disabilities in every aspect of community life.\n- We work closely with individuals and their families to help them strengthen basic life skills, achieve their goals and reach their full potential.",
  "599": "Avokado Artists is a 360° arts organization dedicated to cross-cultural understanding through art and the cultivation, promotion, presentation and preservation of culturally significant artists and their work from around the globe, through our own efforts and in conjunction with partnering like-minded organizations. We strive to bring the works of both artists affiliated with Avokado and other outstanding artists to the attention of the broadest possible audience. The organization was founded in 2004, and was granted 501(c)3 status in 2009. We embrace artistry in the fields of music, visual arts and writing. Avokado's mission is to expose the work of these extraordinary artists to the broadest possible audience through myriad mediums including performance, workshops, presentations, publications, video, photography, printed publications including books, electronic media and various contextual materials as well as opportunities for recordings and distribution through our in-house label Avokado Artists Recordings.\n\nAvokado Artists is also founder and presenter of ¡Globalquerque! New Mexico's Annual Celebration Of World Music & Culture, which takes place each September at the National Hispanic Cultural Center in Albuquerque, NM. ¡Globalquerque! features educational outreach, school programs, hands-on cultural interactivities, film and more along side perfromances by some of the planet's most compelling artists. www.Globalquerque.org",
  "631": "## What We Do\r\n\r\n_For 31 years, the Partnership for Community Action has helped develop strong community leaders and advocates by investing in people and creating a strong voice in the communities they call home._\r\n\r\nUnderstanding that people know their own communities best, we build upon personal experiences to impact the greater good. We support families to take ownership of the solutions and lead the way, connecting communities to decision makers, who, together, can create lasting change. The more we invest in solutions that stem from our local communities, the closer we get to a stronger, healthier, and more prosperous New Mexico.\r\n\r\n## Together We Rise\r\n\r\nThe Partnership for Community Action has worked to build strong, healthy communities in Albuquerque’s South Valley and across New Mexico since 1990. PCA focuses on critical community issues like education, economic sustainability, health equity and immigrant rights. Through raising awareness and advocacy opportunities, we support people and families to become strong leaders in their neighborhoods and in New Mexico.\r\n\r\n_PCA is actively working to fight White supremacy and the literal and figurative violence that it breeds through anti-blackness, the erasure of Indigenous peoples, and the oppression of LGBTQ+ communities._",
  "633": "From the moment New Mexico United was founded, community has been at the heart of everything our team does. The Somos Unidos Foundation is our way of doubling down on our commitment to the people of New Mexico. Through this foundation, New Mexico United will continue to be a force of positivity and progress for the state of New Mexico and every New Mexican.\r\n\r\n## We believe in New Mexico.\r\n\r\nThe Somos Unidos Foundation is a 501(c)(3) dedicated to creating positive outcomes for New Mexicans through art, sport, community, and unity. We believe that New Mexico belongs at the top of the positive lists, and the bottom of the negative ones. The success of movements like New Mexico United and Meow Wolf proves that our greatest resources are creativity, and community. Our mission is to create positive outcomes for every New Mexican. We aim to do so through community collaborations, programs that unify our state and by affording equal opportunities to every New Mexican.\r\n\r\n## Our mission transcends a singular cause\r\n\r\nThe Somos Unidos Foundation is a fluid agent of change. Where we are needed, we will go. To date, we have supported youth soccer development, New Mexico schools, healthcare organizations, artists, restaurant workers, and many more. We know that new opportunities will come, and we look forward to standing with our fans and supporters to answer the community’s call.",
  "649": "## Serving New Mexico\r\n\r\nFor over three decades, Albuquerque Health Care for the Homeless (AHCH) has served our community as the only health care organization in Central New Mexico dedicated exclusively to providing services to homeless people. AHCH provides critical services to over 7,000 men, women and children every year. By addressing the health-related causes of homelessness, AHCH makes it possible for people to find solutions to end their homelessness.\r\n\r\n## Mission (Re)Statement \r\n\r\n_Adopted December 2021_\r\n\r\nFueled By Compassion and Driven By Equity, We Lead Boldly, Create Exceptional Health Care Experiences, and Raise Voices to End Homelessness.\r\n##  Mission\r\n\r\nOur mission is to provide caring and comprehensive health and integrated supportive services, linking people experiencing homelessness to individual and collective solutions, and to be a leader in implementing innovative service models and a catalyst for solutions to homelessness and uphold a commitment to diversity and equity.\r\n\r\n## Vision\r\n\r\nTo live in a world that is just and without homelessness.",
  "676": "The New Mexico Peace Choir sings to create positive change!\n\nWe believe the energy we extend through our music can transform our world into a more peaceful and connected place! \n\nThe New Mexico Peace Choir is an inclusive, mixed voice choir welcoming members of all levels of singing ability and experience. We sing inspiring music to foster connection, peace, hope and kindness. We sing in support of equality, inclusion, human rights, and the environment.\n\nUnder the direction of David Poole, the New Mexico Peace Choir inspires peace, social awareness, and positivity through music.\n\nWe currently perform 2 concerts each year and can be seen and heard around Albuquerque at events in support of our community. \n\nVisit https://www.nmpeacechoir.org/ to learn more about us.\n\nYou can follow us on Facebook, Instagram, and YouTube. \n\nInterested in singing with us? \ndirector@nmpeacechoir.org\n\nWould you like to further support NMPC? \nphilanthropy@nmpeacechoir.org\n\nFor more information about NMPC: secretary@nmpeacechoir.org",
  "821": "## Support Services\r\n\r\nThe Gynecological Cancer Awareness Project offers a variety of programs and services to help people affected by gynecological cancers. We have several programs and services that are available to people affected by any cancer.\r\n\r\n## About Us\r\n\r\nThe Gynecological Cancer Awareness Project was founded in 2010 by an oncology nurse and a group of survivors undergoing chemo treatment. They recognized the psycho-social needs of these types of survivors and jumped into action.\r\n\r\n### Mission\r\n\r\n To empower all people in the southwest affected by gynecological cancers by providing education and support-helping them to live a healthy and inspired life. \r\n\r\n### Vision\r\n\r\n That all people in the southwest region affected by gynecological cancers receive the care and support they need to maintain their quality of life. \r\n\r\n### Purpose\r\n\r\n To bring joy, comfort, education, and financial assistance to people affected by gynecological cancers in New Mexico.",
  "827": "## Who we are\r\n\r\nPaws and Stripes was founded in Rio Rancho in 2010 by Lindsey Kay. Lindsey was motivated by her passion for dogs, love of her country and those who have sacrificed so much to protect it. A veteran family member of Lindsey’s suffering from PTSD and TBI motivated her to research multiple organizations, but was unable to pay for service dogs due to the high cost. This inspired the inception of an organization dedicated to providing service dogs at no cost to veterans in order to fill this critical unmet need for veterans. \r\n\r\nIn 2010, Paws and Stripes graduated their first team. By 2012, Paws and Stripes officially integrated a mental health component to its training programs. Since inception almost 10 years ago, Paws and Stripes has served veterans, rescued and rehabilitated shelter dogs as service dogs and refined its mental health programming.\r\n\r\nIn the early days, Paws and Stripes received press and recognition for the unique and much needed programming from Time Magazine, Bark Magazine, Lisa Ling’s Our America, Stephen Colbert's Dream Fund, and Tractor Supply Magazine in addition to presenting internationally in Croatia and nationally in New York and at Yale University. In 2014, A&E's docu-series, Dogs of War, featured 5 episodes about Paws and Stripes.\r\n\r\nIn 2017, Paws and Stripes officially moved into a new facility, a generous donation to further its mission in Albuquerque.",
  "843": "## Who is DVRC?\r\n\r\n_Trustworthiness - Growth - Safety - Compassion - Resiliency_\r\n\r\nThe Domestic Violence Resource Center (DVRC) is a Trauma-Informed Agency whose main focus is to help victims of domestic violence break the cycle of abuse in their lives. Each department (Advocacy and Case Management) is here to provide the resources, guidance, and support needed to help victims get to safety, become independent, and heal.\r\nWe are working to change the social norms that contribute to the continuance of violence. Our goal is to help a victim break the cycle of violence and heal in order to have healthy relationships in the future.  All services at DVRC, Inc. are free, confidential, and always handled by trained professionals.\r\n\r\n## Empowering Victims\r\n\r\n_You are not alone_\r\n\r\nDVRC, Inc. is here to Empower Victims of Domestic Violence and Engage the Community to End the Cycle of Domestic Violence through Education and Prevention.\r\n\r\n_Our Commitment to Confidentiality_\r\n\r\nWe are a Trauma Informed Agency whose main focus is to help victims of domestic violence break the cycle of abuse in their lives.  Our goal is to help victims break the cycle of violence and heal in order to have healthy relationships in the future.",
  "884": "## The power and love of local food.\r\nThree Sisters Kitchen is a non-profit community food space in the heart of downtown Albuquerque. A place where delicious, affordable, and locally produced foods come together to nourish our community from the ground up.\r\n\r\n## Our Story\r\n\r\nFood nourishes us, connects us to our traditions and cultures, and creates jobs and economic opportunity in our communities. But limited access to fresh, healthy food, kitchen space, and entrepreneurial support has narrowed opportunities to meaningfully engage in local food systems. At Three Sisters Kitchen we believe that good food, health, and economic opportunity are for everyone. That is why we started our non-profit community food space, including a Cafe, Test Kitchen, Community Classroom, and Local Foods Shop. Three Sisters Kitchen makes fresh, local food accessible, affordable, and fun to cook, and creates pathways for food entrepreneurs to experiment and build businesses that succeed, contributing to a healthier and more vibrant community.\r\n\r\nThree Sisters Kitchen was born from community conversations hosted by the DowntownABQ MainStreet Initiative and the Downtown Growers Market from 2015- 2017 with residents, community-based organizations, social service agencies, and business owners. In response to a community articulated need, the idea for Three Sisters Kitchen emerged to create a warm, welcoming space that celebrates and supports local food producers year-round, promotes a healthy community, and offers meaningful opportunities to engage in the local food system.\r\n\r\nThree Sisters Kitchen fulfills a need and complements existing food and health programming in Albuquerque. Our spaces and our offerings support the incubation of new ideas and contribute towards our vision of a food-secure community with a vibrant culture of health and a deep commitment to food and economic justice.",
  "921": "## Our Service\r\n\r\nCatholic Charities is a 501(c)(3) non-profit corporation serving central New Mexico and is a member of Catholic Charities USA, one of the largest non-profit human services networks in the United States. We are dedicated to finding solutions to some of the most pressing social challenges individuals, children and families face, regardless of race, religion, country of origin, disabilities, gender, age or sexual orientation. \r\n\r\nWe serve individuals and families throughout Bernalillo, Sandoval, Valencia, and Santa Fe counties with a broad spectrum of services geared towards reducing poverty, improving personal opportunity, and encouraging opportunities for service. With about 85 staff members and over 200 volunteers, our agency has been working to create hope for those in need for over 70 years. Although grounded in Catholic Social Teachings and inspired by faith, Catholic Charities provides services to those in need regardless of faith.\r\n\r\n## Our services are encompassed in our seven centers of excellence:\r\n\r\nWhile our name says Catholic, we offer an array of services for people of all different beliefs and backgrounds. We operate through what we call ‘Centers of Excellence’ which include everything from a Childhood Learning Center (pre-K, daycare, etc.), Center for Refugee Support, Center for Immigration and Citizenship, Center for Self-Sufficiency and Housing (and Rehousing) Assistance, helping prevent and overcome homelessness, Center for Community Involvement (senior transport services, furniture and household goods for those we are rehousing, parish and community outreach), and Center for Affordable Housing, where we are building and renovating housing to provide safe, affordable housing, the Center for Educational Opportunities and Career Pathways where adult learning is offered to learn and build a career including digital learning to CDL driver training.",
  "934": "## We Care for Those Who Care for Others\r\n\r\nFamily Caregiver Center of New Mexico supports the well-being of family caregivers through resources, respite, social connection, and mental health care. We provide services to those caring for adults 18 years and older.\r\n\r\nA family caregiver can be a spouse, partner, sibling, adult child, parent, chosen family, neighbor, or friend.\r\n\r\n## Are you caring for someone with a serious illness or condition?\r\n\r\nFamily caregivers provide assistance with another person’s emotional or practical needs. This type of informal help can range from periodic phone calls and visits, meal prep, household chores, grocery shopping, and emotional support, to everyday assistance and responsibility for all personal care.  \r\nThere is no one description of a caregiver, a caregiver's situation, or length of the caregiving journey.\r\n\r\n## How We See Things\r\n\r\nSo often caregivers seek and receive assistance for their loved one. At the Family Caregiver Center, we see things differently. We believe that providing direct and personalized support for family caregivers is essential. Through the breadth of our supportive services - we care for those who care for others.",
  "939": "We work with low-income New Mexicans to improve living conditions, increase opportunities, and protect the rights of people living in poverty.\r\n\r\n## OUR STRATEGIES\r\n\r\nFor over 25 years, the New Mexico Center on Law and Poverty has taken action with our communities to achieve bold, system-wide change that promotes the well-being of our state’s children, families, workers, and communities. We work on key priorities like the public education system, food justice, income assistance, affordable healthcare, worker’s rights, housing rights, and the fight against predatory lending.\r\n\r\nWe advance change in the courts, the legislature, and our public institutions through a multi-pronged approach:\r\n\r\n* __Collaboration__ to engage with people and organizations to identify priorities and partner in developing solutions on the issues most important to them. We also convene and build coalitions with networks of community members, organizers, advocates, direct service providers, private attorneys, and other stakeholders to build campaigns together.\r\n\r\n* __Policy Advocacy__ to pursue changes to laws and policies that are equitable and responsive to our communities. We provide research and analysis of complex laws and regulations, provide information and expertise for policymakers and state officials, and partner with our communities to engage in legislative and administrative advocacy.\r\n\r\n* __Outreach and education__ including Know Your Rights trainings, videos and materials. Our communications and media strategies amplify the experiences of people and build broader awareness about key issues that impact New Mexicans.\r\n\r\n* __Legal representation__ in the courts and administrative hearings. We conduct impact litigation to address systemwide injustices, enforce rights and hold our public institutions accountable to following the law.",
  "971": "​Founded in 2013, Rio Rancho Creative Crossroads' (RRCC) mission is to bring high quality, reasonably priced cultural art to Rio Rancho. You heard me, right here in Rio Rancho. We focus on finding ways to introduce our members and our community to bigger, bolder, different, extraordinary artistic experiences you would never expect to get in Rio Rancho.\n\nYou may not recognize the name Rio Rancho Creative Crossroads, because you may know us by one of our program names. We have three chorale programs, Children's Chorus of Rio Rancho, Rio Rancho Youth Chorus, and our advanced chorus, Encore. We are also GenerARTistry, which helps local talents produce their art in an easily consumable fashion so they can use their gifts to gift their community. Our first project is called The Squeaky Shoes project. We helped local author Debbie Coston make a coloring book version of her story Stanley and the Squeaky Shoes and we will help her realize her passion, making sure every kid has a new pair of shoes for their first day of school. In November 2019, RRCC joined with Mel Sussman to bring a community theater group to town, Rio Rancho Players Community Theatre (RRP).  RRP is an all ages community theater that rehearses and performs in Rio Rancho!  In 2021, we launched the Children's Chorus of Rio Rancho.  Based on our RRYC model, this open, cooperative chorus for 2nd - 5th graders is extremely popular, filling to capacity in only it's first season! And in 2023 we launched Rio Rancho Art on the Mesa, an all ages art workshop series including Mini Monet, Draw All You Can, and Beginner Block Printing, etc.\n\nIf you are a lover of the arts, join us! RRCC is ready, willing, and able to build a diverse and thriving arts community inside our city limits. But we cannot do it alone. We need your help. We are always looking to partner with local businesses for sponsorship and support. We also collaborate/partner with non-profit organizations to create new experiences across different audiences.",
  "1024": "Founded in 1991, the mission of the Albuquerque Girl Choir is to provide a positive musical experience for girls as they learn music fundamentals through vocal training and performance in an upbeat, encouraging atmosphere.  As members learn to express their joy in music, they experience personal growth and increased self-confidence.  AGC is comprised of two groups that teach music fundamentals according to age and ability.  As girls progress, they gain increasing competence with a variety of musical styles and vocal abilities.  AGC is open to enrollment for any girl, grades 2nd - 12th, who loves to sing…no auditions required.\r\n\r\n\r\n__The Prep Choir__ - is generally comprised of girls in 2nd - 4th grades.  Choir members learn music fundamentals such as rhythm, pitch, and vocal expression.  Active participation is based on the theory of \"rote before note - sound before sight.\"  The girls develop music thinking skills and improve in their level of musicianship as they sing a variety of music in a fun, encouraging atmosphere.\r\n\r\n__The Main Choir__ - is primarily comprised of girls in 4th grade and up.  The Main Choir builds upon the fundamentals taught in the Prep Choir and utilizes a diverse repertoire of music including classical, contemporary, gospel, folk, patriotic, seasonal, and foreign songs to build understanding, experience, and confidence.  Choir members learn the discipline of blending voices and singing parts using printed music and the ear.\r\n\r\n__Rehearsal__ - Rehearsals are held Thursday evenings at First Presbyterian Church at 215 Locust St NE in Albuquerque.  The Prep Choir practices from 5 p.m. - 6:00 p.m.  The Main Choir practices from 5 p.m. - 6:30 p.m.\r\n\r\n__Performances__ - Because performance is part of our mission, we strive to schedule at least four performances per semester.  In addition to traditional winter and spring concerts, past performances have included performing with other music groups such as the American Boy Choir, US Naval Academy Women’s Glee Club, Tucson Girl Choir, ABQ Boy Choir, and the ABQ Youth Symphony.  Also, other past performances have been at the ABQ Botanical Garden’s River of Lights, the Balloon Museum’s Children’s Festival, Isotopes Ball Games and frequent visits to local retirement centers.  The performance schedule is updated on the Events page of this website and parents are also notified as dates are firmed up."
}